---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerInfo.RemoveCutLayerModifier(Autodesk.Revit.DB.LayerModifier)
source: html/7d1a5f23-45f6-7ba5-2c46-31733fbafe5c.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.RemoveCutLayerModifier Method

Removes a cut layer modifier from the layer info.

## Syntax (C#)
```csharp
public void RemoveCutLayerModifier(
	LayerModifier layerModifier
)
```

## Parameters
- **layerModifier** (`Autodesk.Revit.DB.LayerModifier`) - The cut layer modifier.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null